marjonz/nrf9160-feather-examples-and-drivers/fleetpin/src/epaper/epaper_driver.c
/*****************************************************************************
* | File      	:  	EPD_4in26.c
* | Author      :   Waveshare team
* | Function    :   4.26inch e-paper test demo
* | Info        :
*----------------
* |	This version:   V1.0
* | Date        :   2023-12-19
* | Info        :
* -----------------------------------------------------------------------------
#
# Permission is hereby granted, free of charge, to any person obtaining a copy
# of this software and associated documnetation files (the "Software"), to deal
# in the Software without restriction, including without limitation the rights
# to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
# copies of the Software, and to permit persons to  whom the Software is
# furished to do so, subject to the following conditions:
#
# The above copyright notice and this permission notice shall be included in
# all copies or substantial portions of the Software.
#
# THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
# IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
# FITNESS OR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
# AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
# LIABILITY WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
# OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
# THE SOFTWARE.
#
******************************************************************************
from : https://github.com/waveshareteam/e-Paper/blob/master/RaspberryPi_JetsonNano/c/lib/e-Paper/EPD_4in26.c
******************************************************************************/
#include "epaper_driver.h"

#include <zephyr/kernel.h>
#include <zephyr/device.h>
#include <zephyr/devicetree.h>
#include <zephyr/drivers/gpio.h>
#include <zephyr/drivers/spi.h>
#include <zephyr/logging/log.h>

#ifdef DISABLE_BUSY_CHECK_FOR_DEBUGGING
#include <hal/nrf_gpio.h>
#endif

LOG_MODULE_REGISTER(epaper_driver, LOG_LEVEL_WRN);

const unsigned char LUT_DATA_4Gray[112] =    //112bytes
{											
    0x80u,	0x48u,	0x4Au,	0x22u,	0x00u,	0x00u,	0x00u,	0x00u,	0x00u,	0x00u,	
    0x0Au,	0x48u,	0x68u,	0x00u,	0x00u,	0x00u,	0x00u,	0x00u,	0x00u,	0x00u,	
    0x88u,	0x48u,	0x60u,	0x00u,	0x00u,	0x00u,	0x00u,	0x00u,	0x00u,	0x00u,	
    0xA8u,	0x48u,	0x45u,	0x00u,	0x00u,	0x00u,	0x00u,	0x00u,	0x00u,	0x00u,	
    0x00u,	0x00u,	0x00u,	0x00u,	0x00u,	0x00u,	0x00u,	0x00u,	0x00u,	0x00u,	
    0x07u,	0x1Eu,	0x1Cu,	0x02u,	0x00u,						
    0x05u,	0x01u,	0x05u,	0x01u,	0x02u,						
    0x08u,	0x01u,	0x01u,	0x04u,	0x04u,						
    0x00u,	0x02u,	0x00u,	0x02u,	0x01u,						
    0x00u,	0x00u,	0x00u,	0x00u,	0x00u,						
    0x00u,	0x00u,	0x00u,	0x00u,	0x00u,						
    0x00u,	0x00u,	0x00u,	0x00u,	0x00u,						
    0x00u,	0x00u,	0x00u,	0x00u,	0x00u,						
    0x00u,	0x00u,	0x00u,	0x00u,	0x00u,						
    0x00u,	0x00u,	0x00u,	0x00u,	0x01u,						
    0x22u,	0x22u,	0x22u,	0x22u,	0x22u,						
    0x17u,	0x41u,	0xA8u,	0x32u,	0x30u,						
    0x00u,	0x00u,	
};	

#define EPAPER_DEVICE_NODE_ID DT_NODELABEL(epaper_device)
static const struct device *spi_dev = DEVICE_DT_GET(DT_BUS(EPAPER_DEVICE_NODE_ID));
static const struct spi_dt_spec spi = 
    SPI_DT_SPEC_GET(
        EPAPER_DEVICE_NODE_ID, 
        (SPI_OP_MODE_MASTER | SPI_WORD_SET(8) | SPI_TRANSFER_MSB), 
        0
    );

#define INACTIVE_LOGIC          0
#define ACTIVE_LOGIC            1   
#define DATA_CMD_IS_COMMAND     0
#define DATA_CMD_IS_DATA        1

#define SPI_EPAPER_NODE_ID DT_NODELABEL(epaper_device)
// Reset pin is active low, so idle high.
static const struct gpio_dt_spec reset_gpio = GPIO_DT_SPEC_GET(EPAPER_DEVICE_NODE_ID, rst_gpios);
static const struct gpio_dt_spec data_cmd_gpio = GPIO_DT_SPEC_GET(EPAPER_DEVICE_NODE_ID, data_command_gpios);
static const struct gpio_dt_spec busy_gpio = GPIO_DT_SPEC_GET(EPAPER_DEVICE_NODE_ID, busy_gpios);
static const struct gpio_dt_spec power_gpio = GPIO_DT_SPEC_GET(EPAPER_DEVICE_NODE_ID, pwr_gpios);
static const struct gpio_dt_spec chip_select_gpio = GPIO_DT_SPEC_GET(EPAPER_DEVICE_NODE_ID, chip_select_gpios);

// Turn on ePaper power supply.
#define POWER_ON()  do { \
                        gpio_pin_set_dt(&power_gpio, ACTIVE_LOGIC); \
                        k_msleep(10);                               \
                    } while (0)

// Turn off ePaper power supply.
#define POWER_OFF() gpio_pin_set_dt(&power_gpio, INACTIVE_LOGIC);

// NOTE: For some reason, the RESET output pin's logic is inverted in hardware.
// When writing 1 to the pin, the output is low, and vice versa.
#define RESET_ACTIVE()   do { \
                                gpio_pin_set_dt(&reset_gpio, ACTIVE_LOGIC); \
                         } while (0)

#define RESET_INACTIVE()   do { \
                                gpio_pin_set_dt(&reset_gpio, INACTIVE_LOGIC); \
                         } while (0)

#define CS_ACTIVE()   do { \
                                gpio_pin_set_dt(&chip_select_gpio, ACTIVE_LOGIC); \
                         } while (0)

#define CS_INACTIVE()   do { \
                                gpio_pin_set_dt(&chip_select_gpio, INACTIVE_LOGIC); \
                         } while (0)

#define SEND_COMMAND()   do { \
                                gpio_pin_set_dt(&data_cmd_gpio, DATA_CMD_IS_COMMAND); \
                         } while (0)

#define SEND_DATA()   do { \
                                gpio_pin_set_dt(&data_cmd_gpio, DATA_CMD_IS_DATA); \
                      } while (0)
                            

#define TX_BUFFER_SIZE 120 
#define RX_BUFFER_SIZE 20 
// NOTE: The ePaper does not have a MOSI line, to it can't transmit data out.
static uint8_t tx_buf_data[TX_BUFFER_SIZE] = { 0 };
static struct spi_buf tx_buf = 
{
    .buf = tx_buf_data,
    .len = sizeof(tx_buf_data),
};
static struct spi_buf_set tx = 
{
    .buffers = &tx_buf,
    .count = 1,
};

/******************************************************************************
function :	Software reset
parameter:
******************************************************************************/
static void EPD_4in26_Reset(void)
{
    RESET_INACTIVE();
    k_msleep(100);
    RESET_ACTIVE();
    k_msleep(2);
    RESET_INACTIVE();
    k_msleep(100);
}


static inline bool is_busy(void)
{
    return (gpio_pin_get_dt(&busy_gpio) != INACTIVE_LOGIC);
}

