marjonz/nrf9160-feather-examples-and-drivers/fleetpin/src/epaper/epaper_driver.c
/******************************************************************************
 * Helper function to send n bytes over SPI
 *****************************************************************************/
static void send_n_bytes(uint8_t *data, size_t len)
{
    if (spi_dev != NULL) 
    {
        memset(tx_buf_data, 0, sizeof(tx_buf_data));
        size_t data_len = len < TX_BUFFER_SIZE ? len : sizeof(tx_buf_data);
        for (size_t i = 0; i < data_len; i++) 
        {
            // Send one byte at a time, so as not to flood the shift registers of the ePaper.
            tx_buf_data[0] = *data;
            tx_buf.len = 1;
            data++;
            int ret = spi_write_dt(&spi, &tx);
            if (ret != 0) 
            {
                LOG_DBG("SPI command transfer failed: %d", ret);
                break;
            }

            // If the device is busy, wait until it's free. 
            // The ePaper is very slow, and probably just has shift registers.
            while (is_busy()) 
            {
                k_msleep(1);
            }
        }
    }
    else 
    {
        LOG_DBG("SPI device not initialized");
    }
}

/******************************************************************************
function :	send command
parameter:
     Reg : Command register
******************************************************************************/
static void EPD_4in26_SendCommand(uint8_t Reg)
{
    LOG_DBG("EPD_4in26_SendCommand: 0x%02X", Reg);
    SEND_COMMAND();
    CS_ACTIVE();
    send_n_bytes(&Reg, sizeof(Reg));
    CS_INACTIVE();
}

/******************************************************************************
function :	send data
parameter:
    Data : Write data
******************************************************************************/
static void EPD_4in26_SendData(uint8_t Data)
{
    LOG_DBG("EPD_4in26_SendData: 0x%02X", Data);
    SEND_DATA();
    CS_ACTIVE();
    send_n_bytes(&Data, sizeof(Data));
    CS_INACTIVE();
}

static void EPD_4in26_SendData2(uint8_t *pData, size_t len)
{
    LOG_DBG("EPD_4in26_SendData2: 0x%02X of len: %d", pData[0], len);
    SEND_DATA();
    CS_ACTIVE();
    send_n_bytes(pData, len);
    CS_INACTIVE();
}

/******************************************************************************
function :	Wait until the busy_pin goes LOW
parameter:
******************************************************************************/
#ifndef DISABLE_BUSY_CHECK_FOR_DEBUGGING
void EPD_4in26_ReadBusy(void)
{
    while(is_busy())
	{	//=1 BUSY (ACTIVE HIGH)
        LOG_DBG("e-Paper busy.");
		k_msleep(50);
	}
	k_msleep(50);
    LOG_DBG("e-Paper not busy.");
}

void EPD_4in26_ReadBusy_Debug(void) 
{
    // UNUSED when production code.
}

#else
void EPD_4in26_ReadBusy(void)
{
    LOG_DBG("e-Paper busy release");
}

void EPD_4in26_ReadBusy_Debug(void)
{
    bool busy_status = is_busy();
    int pin_value = nrf_gpio_pin_out_read(busy_gpio.pin);
    while(1)
	{	 //=1 BUSY (ACTIVE HIGH)
        LOG_DBG("DBG busy: %d %d", busy_status, pin_value);
		k_msleep(4000);
        busy_status = is_busy();
	}
	k_msleep(1000);
    LOG_DBG("DBG release: %d %d", busy_status, pin_value);
}
#endif

/******************************************************************************
function :	Helper function to send display update data
parameter:
******************************************************************************/
static inline void send_display_update_data(uint8_t data)
{
	EPD_4in26_SendCommand(0x22u); //Display Update Control
	EPD_4in26_SendData(data);
	EPD_4in26_SendCommand(0x20u); //Activate Display Update Sequence
	EPD_4in26_ReadBusy();
}

/******************************************************************************
function :	Turn On Display
parameter:
******************************************************************************/
static void EPD_4in26_TurnOnDisplay(void)
{
    send_display_update_data(0xF7u);
}

static void EPD_4in26_TurnOnDisplay_Fast(void)
{
    send_display_update_data(0xC7u);
}

static void EPD_4in26_TurnOnDisplay_Part(void)
{
    send_display_update_data(0xFFu);
}

static void EPD_4in26_TurnOnDisplay_4GRAY(void)
{
    send_display_update_data(0xC7u);
}

/******************************************************************************
function :	set the look-up tables
parameter:
******************************************************************************/
static void EPD_4in26_Lut(void)
{
    uint16_t count;
    EPD_4in26_SendCommand(0x32u); //vcom
    for(count = 0u; count < 105u ; count++) 
    {
        EPD_4in26_SendData(LUT_DATA_4Gray[count]);
    }

    EPD_4in26_SendCommand(0x03u); //VGH      
	EPD_4in26_SendData(LUT_DATA_4Gray[105u]);

	EPD_4in26_SendCommand(0x04); //      
	EPD_4in26_SendData(LUT_DATA_4Gray[106u]); //VSH1   
	EPD_4in26_SendData(LUT_DATA_4Gray[107u]); //VSH2   
	EPD_4in26_SendData(LUT_DATA_4Gray[108u]); //VSL   

	EPD_4in26_SendCommand(0x2Cu);     //VCOM Voltage
	EPD_4in26_SendData(LUT_DATA_4Gray[109u]);    //0x1C
}

static inline void send_position_data(uint16_t pos)
{
    EPD_4in26_SendData(pos & 0xFFu);
    EPD_4in26_SendData((pos >> 8u) & 0x03u);
}

/******************************************************************************
function :	Setting the display window
parameter:
******************************************************************************/
static void EPD_4in26_SetWindows(uint16_t Xstart, uint16_t Ystart, uint16_t Xend, uint16_t Yend)
{
    EPD_4in26_SendCommand(0x44u); // SET_RAM_X_ADDRESS_START_END_POSITION
    send_position_data(Xstart);
    send_position_data(Xend);
	
    EPD_4in26_SendCommand(0x45u); // SET_RAM_Y_ADDRESS_START_END_POSITION
    send_position_data(Ystart);
    send_position_data(Yend);
}

/******************************************************************************
function :	Set Cursor
parameter:
******************************************************************************/
static void EPD_4in26_SetCursor(uint16_t Xstart, uint16_t Ystart)
{
    EPD_4in26_SendCommand(0x4Eu); // SET_RAM_X_ADDRESS_COUNTER
    send_position_data(Xstart);

    EPD_4in26_SendCommand(0x4Fu); // SET_RAM_Y_ADDRESS_COUNTER
    send_position_data(Ystart);
}

