marjonz/nrf9160-feather-examples-and-drivers/fleetpin/src/epaper/epaper_driver.c
static void configure_pins_and_power_on(void)
{
    if (!spi_is_ready_dt(&spi)) 
    {
        LOG_ERR("EPAPER SPI not ready");
        return;
    }
    
    int err = gpio_pin_configure_dt(&power_gpio, GPIO_OUTPUT_INACTIVE);
    if (!device_is_ready(power_gpio.port) || (err != 0)) 
    {
        LOG_ERR("EPAPER POWER GPIO not ready");
        return;
    }
    POWER_ON();

    err = gpio_pin_configure_dt(&reset_gpio, GPIO_OUTPUT_HIGH);
    if (!device_is_ready(reset_gpio.port) || (err != 0)) 
    {
        LOG_ERR("EPAPER RESET GPIO not ready");
        return;
    }
    RESET_INACTIVE();

    err = gpio_pin_configure_dt(&chip_select_gpio, GPIO_OUTPUT_HIGH);
    if (!device_is_ready(chip_select_gpio.port) || (err != 0)) 
    {
        LOG_ERR("EPAPER CHIP SELECT GPIO not ready");
        return;
    }
    CS_INACTIVE();

    err = gpio_pin_configure_dt(&data_cmd_gpio, GPIO_OUTPUT_LOW);
    if (!device_is_ready(data_cmd_gpio.port) || (err != 0)) 
    {
        LOG_ERR("EPAPER DATA/CMD GPIO not ready");
        return;
    }

    err = gpio_pin_configure_dt(&busy_gpio, GPIO_INPUT);
    if (!gpio_is_ready_dt(&busy_gpio) || (err != 0)) 
    {
        LOG_ERR("EPAPER BUSY GPIO not ready");
        return;
    }

    LOG_DBG("EPAPER GPIO ready and device is powered on.");
}

/******************************************************************************
function :	Initialize the e-Paper register
parameter:
******************************************************************************/
void EPD_4in26_Init(void)
{
    configure_pins_and_power_on();

	EPD_4in26_Reset();
    LOG_DBG("EPAPER device reset. Init");
	k_msleep(100);

	EPD_4in26_ReadBusy();   
	EPD_4in26_SendCommand(0x12u);  //SWRESET
	EPD_4in26_ReadBusy();   
	
	EPD_4in26_SendCommand(0x18u); // use the internal temperature sensor
	EPD_4in26_SendData(0x80u);

	EPD_4in26_SendCommand(0x0Cu); //set soft start     
	EPD_4in26_SendData(0xAEu);
	EPD_4in26_SendData(0xC7u);
	EPD_4in26_SendData(0xC3u);
	EPD_4in26_SendData(0xC0u);
	EPD_4in26_SendData(0x80u);

	EPD_4in26_SendCommand(0x01u);   //      drive output control    
	EPD_4in26_SendData((EPD_4in26_HEIGHT-1)%256); //  Y  
	EPD_4in26_SendData((EPD_4in26_HEIGHT-1)/256); //  Y 
	EPD_4in26_SendData(0x02);

	EPD_4in26_SendCommand(0x3C);        // Border       Border setting 
	EPD_4in26_SendData(0x01);

	EPD_4in26_SendCommand(0x11);        //    data  entry  mode
	EPD_4in26_SendData(0x01);           //       X-mode  x+ y-    

	EPD_4in26_SetWindows(0, EPD_4in26_HEIGHT-1, EPD_4in26_WIDTH-1, 0);

	EPD_4in26_SetCursor(0, 0);

	EPD_4in26_ReadBusy();
}

void EPD_4in26_Init_Fast(void)
{
    configure_pins_and_power_on();

	EPD_4in26_Reset();
    LOG_DBG("EPAPER device reset. Init Fast");
	k_msleep(100);

	EPD_4in26_ReadBusy();   
	EPD_4in26_SendCommand(0x12u);  //SWRESET
	EPD_4in26_ReadBusy();   
	
	EPD_4in26_SendCommand(0x18u); // use the internal temperature sensor
	EPD_4in26_SendData(0x80u);

	EPD_4in26_SendCommand(0x0Cu); //set soft start     
	EPD_4in26_SendData(0xAEu);
	EPD_4in26_SendData(0xC7u);
	EPD_4in26_SendData(0xC3u);
	EPD_4in26_SendData(0xC0u);
	EPD_4in26_SendData(0x80u);

	EPD_4in26_SendCommand(0x01u);   //      drive output control    
	EPD_4in26_SendData((EPD_4in26_HEIGHT-1) % 256); //  Y  
	EPD_4in26_SendData((EPD_4in26_HEIGHT-1) / 256); //  Y 
	EPD_4in26_SendData(0x02u);

	EPD_4in26_SendCommand(0x3Cu);        // Border       Border setting 
	EPD_4in26_SendData(0x01u);

	EPD_4in26_SendCommand(0x11u);        //    data  entry  mode
	EPD_4in26_SendData(0x01u);           //       X-mode  x+ y-    

	EPD_4in26_SetWindows(0, EPD_4in26_HEIGHT-1, EPD_4in26_WIDTH-1, 0);

	EPD_4in26_SetCursor(0, 0);

	EPD_4in26_ReadBusy();

	//TEMP (1.5s)
	EPD_4in26_SendCommand(0x1Au);  
    EPD_4in26_SendData(0x5Au); 

    EPD_4in26_SendCommand(0x22u);  
    EPD_4in26_SendData(0x91u); 
    EPD_4in26_SendCommand(0x20u); 
	
	EPD_4in26_ReadBusy();
}

void EPD_4in26_Init_4GRAY(void)
{
    configure_pins_and_power_on();
    
    EPD_4in26_Reset();
    LOG_DBG("EPAPER device reset. Init 4GRAY");
	k_msleep(100);

	EPD_4in26_ReadBusy();   
	EPD_4in26_SendCommand(0x12u);  //SWRESET
	EPD_4in26_ReadBusy();   
	
	EPD_4in26_SendCommand(0x18u); // use the internal temperature sensor
	EPD_4in26_SendData(0x80u);
	EPD_4in26_SendCommand(0x0Cu); //set soft start     
	EPD_4in26_SendData(0xAEu);
	EPD_4in26_SendData(0xC7u);
	EPD_4in26_SendData(0xC3u);
	EPD_4in26_SendData(0xC0u);
	EPD_4in26_SendData(0x80u);

	EPD_4in26_SendCommand(0x01u);   //      drive output control    
	EPD_4in26_SendData((EPD_4in26_WIDTH-1) % 256); //  Y  
	EPD_4in26_SendData((EPD_4in26_WIDTH-1) / 256); //  Y 
	EPD_4in26_SendData(0x02u);

	EPD_4in26_SendCommand(0x3Cu);        // Border       Border setting 
	EPD_4in26_SendData(0x01u);

	EPD_4in26_SendCommand(0x11u);        //    data  entry  mode
	EPD_4in26_SendData(0x01u);           //       X-mode  x+ y-    
	
    EPD_4in26_SetWindows(0, EPD_4in26_HEIGHT-1, EPD_4in26_WIDTH-1, 0);

	EPD_4in26_SetCursor(0, 0);

	EPD_4in26_ReadBusy();

    EPD_4in26_Lut();
}

/******************************************************************************
function :	Clear screen
parameter:
******************************************************************************/
void EPD_4in26_Clear(void)
{
	uint16_t i;
	uint16_t height = EPD_4in26_HEIGHT;
	uint16_t width = EPD_4in26_WIDTH / 8u;	
	uint8_t image[EPD_4in26_WIDTH / 8u] = {0};
    for(i = 0u; i < width; i++) 
    {
        image[i] = 0xFFu;
    }
    
	EPD_4in26_SendCommand(0x24u);   //write RAM for black(0)/white (1)
	for(i = 0u; i < height; i++)
	{
	    EPD_4in26_SendData2(image, width);
	}

	EPD_4in26_SendCommand(0x26u);   //write RAM for black(0)/white (1)
	for(i = 0u; i < height; i++)
	{
		EPD_4in26_SendData2(image, width);
	}
	EPD_4in26_TurnOnDisplay();
}

/******************************************************************************
function :	Sends the image buffer in RAM to e-Paper and displays
parameter:
******************************************************************************/
void EPD_4in26_Display(uint8_t *Image)
{
	uint16_t i;
	uint16_t height = EPD_4in26_HEIGHT;
	uint16_t width = EPD_4in26_WIDTH/8;
	
