marjonz/nrf9160-feather-examples-and-drivers/fleetpin/src/epaper/epaper_driver.c
	EPD_4in26_SendCommand(0x24u);   //write RAM for black(0)/white (1)
	for( i = 0u; i < height; i++)
	{
        EPD_4in26_SendData2((uint8_t *)(Image+i*width), width);
	}
	EPD_4in26_TurnOnDisplay();	
}

void EPD_4in26_Display_Base(uint8_t *Image)
{
	uint16_t i;
	uint16_t height = EPD_4in26_HEIGHT;
	uint16_t width = EPD_4in26_WIDTH/8;
	
    LOG_DBG("EPD_4in26_Display_Base");
	
    EPD_4in26_SendCommand(0x24u);   //write RAM for black(0)/white (1)
	for(i = 0u; i < height; i++)
	{
		EPD_4in26_SendData2((uint8_t *)(Image+i*width), width);
	}

	EPD_4in26_SendCommand(0x26u);   //write RAM for black(0)/white (1)
	for(i = 0u; i < height; i++)
	{
		EPD_4in26_SendData2((uint8_t *)(Image+i*width), width);
	}
	EPD_4in26_TurnOnDisplay();	
}

void EPD_4in26_Display_Fast(uint8_t *Image)
{
	uint16_t i;
	uint16_t height = EPD_4in26_HEIGHT;
	uint16_t width = EPD_4in26_WIDTH/8;

    LOG_DBG("EPD_4in26_Display_Fast");
	
	EPD_4in26_SendCommand(0x24u);   //write RAM for black(0)/white (1)
	for(i = 0u; i < height; i++)
	{
		EPD_4in26_SendData2((uint8_t *)(Image+i*width), width);
	}
	EPD_4in26_TurnOnDisplay_Fast();	
}

void EPD_4in26_Display_Part(uint8_t *Image, uint16_t x, uint16_t y, uint16_t w, uint16_t l)
{
	uint16_t i;
	uint16_t height = l;
	uint16_t width =  (w % 8u == 0u) ? (w / 8u): ((w / 8u) + 1);

    LOG_DBG("EPD_4in26_Display_Fast");
    
    EPD_4in26_Reset();

	EPD_4in26_SendCommand(0x18u); // use the internal temperature sensor
	EPD_4in26_SendData(0x80u);

	EPD_4in26_SendCommand(0x3Cu);        // Border       Border setting 
	EPD_4in26_SendData(0x80u);

	EPD_4in26_SetWindows(x, y, x+w-1, y+l-1);

	EPD_4in26_SetCursor(x, y);

	EPD_4in26_SendCommand(0x24u);   //write RAM for black(0)/white (1)
	for( i = 0u; i < height; i++)
	{
		EPD_4in26_SendData2((uint8_t *)(Image+i*width), width);
	}
	EPD_4in26_TurnOnDisplay_Part();	
}

void EPD_4in26_4GrayDisplay(uint8_t *Image)
{
    uint16_t i,j,k;
    uint8_t temp1,temp2,temp3;

    // old  data
    EPD_4in26_SendCommand(0x24);
    for(i = 0u; i < 48000u; i++) 
    {             //5808*4  46464
        temp3=0;
        for(j = 0u; j < 2u; j++) 
        {
            temp1 = Image[i*2+j];
            for(k = 0u; k < 2; k++) 
            {
                temp2 = (temp1 & 0xC0u);
                switch(temp2)
                {
                    case 0xC0u:
                        temp3 |= 0x00u;
                        break;
                    case 0x00u:
                    case 0x80u:
                        temp3 |= 0x01u;
                        break;
                    case 0x40u:
                    default:
                        temp3 |= 0x01u; 
                        break;
                }
                temp3 <<= 1u;

                temp1 <<= 2u;
                temp2 = (temp1 & 0xC0u);
                switch(temp2)
                {
                    case 0xC0u:
                        temp3 |= 0x00;
                        break;
                    case 0x00u:
                    case 0x80u:
                        temp3 |= 0x01u;
                        break;
                    case 0x40u:
                    default:
                        temp3 |= 0x00u; 
                        break;
                }

                if((j!=1u) || (k!=1))
                {
                    temp3 <<= 1u;
                }

                temp1 <<= 2u;
            }

        }
        EPD_4in26_SendData(temp3);
    }

    EPD_4in26_SendCommand(0x26u);   //write RAM for black(0)/white (1)
    for(i = 0u; i < 48000u; i++) 
    {             //5808*4  46464
        temp3=0;
        for( j = 0; j < 2; j++) 
        {
            temp1 = Image[i*2+j];
            for(k=0; k<2; k++) 
            {
                temp2 = temp1 & 0xC0u ;
                switch(temp2)
                {
                    case 0xC0u:
                        temp3 |= 0x00u; //white
                        break;
                    case 0x00u:
                        temp3 |= 0x01u;  //black
                        break;
                    case 0x80u:
                        temp3 |= 0x00u;  //gray1
                        break;
                    case 0x40u:
                    default:
                        temp3 |= 0x01u; //gray2
                        break;
                }
                temp3 <<= 1u;

                temp1 <<= 2u;
                temp2 = (temp1 & 0xC0u);
                switch(temp2)
                {
                    case 0xC0u:
                        temp3 |= 0x00u;  //white
                        break;
                    case 0x00u:
                        temp3 |= 0x01u; //black
                        break;
                    case 0x80u:
                        temp3 |= 0x00u; //gray1
                        break;
                    case 0x40u:
                    default:
                        temp3 |= 0x01u;	//gray2
                        break;
                }

                if((j != 1u) || (k != 1u))
                {
                    temp3 <<= 1u;
                }

                temp1 <<= 2u;
            }
        }
        EPD_4in26_SendData(temp3);
    }

    EPD_4in26_TurnOnDisplay_4GRAY();
}

/******************************************************************************
function :	Enter sleep mode
parameter:
******************************************************************************/
void EPD_4in26_Sleep(void)
{
	EPD_4in26_SendCommand(0x10u); //enter deep sleep
	EPD_4in26_SendData(0x03u); 
	k_msleep(3000);
    POWER_OFF();
}

void EPD_4in26_RePowerOn(void)
{
    POWER_ON();
    k_msleep(100);
}